/*
1068 万绿丛中一点红 （20 分）
对于计算机而言，颜色不过是像素点对应的一个 24 位的数值。现给定一幅分辨率为 M×N 的画，要求你找出万绿丛中
的一点红，即有独一无二颜色的那个像素点，并且该点的颜色与其周围 8 个相邻像素的颜色差充分大。

输入格式：
输入第一行给出三个正整数，分别是 M 和 N（≤ 1000），即图像的分辨率；以及 TOL，是所求像素点与相邻点的颜色
差阈值，色差超过 TOL 的点才被考虑。随后 N 行，每行给出 M 个像素的颜色值，范围在 [0,2^24) 内。所有同行
数字间用空格或 TAB 分开。

输出格式：
在一行中按照 (x, y): color 的格式输出所求像素点的位置以及颜色值，其中位置 x 和 y 分别是该像素在图像矩阵
中的列、行编号（从 1 开始编号）。如果这样的点不唯一，则输出 Not Unique；如果这样的点不存在，则输出 
Not Exist。

输入样例 1：
8 6 200
0 	 0 	  0 	   0	    0 	     0 	      0        0
65280 	 65280    65280    16711479 65280    65280    65280    65280
16711479 65280    65280    65280    16711680 65280    65280    65280
65280 	 65280    65280    65280    65280    65280    165280   165280
65280 	 65280 	  16777015 65280    65280    165280   65480    165280
16777215 16777215 16777215 16777215 16777215 16777215 16777215 16777215

输出样例 1：
(5, 3): 16711680

输入样例 2：
4 5 2
0 0 0 0
0 0 3 0
0 0 0 0
0 5 0 0
0 0 0 0

输出样例 2：
Not Unique

输入样例 3：
3 3 5
1 2 3
3 4 5
5 6 7

输出样例 3：
Not Exist
*/

#include <iostream>
#include <vector>
#include <map>
using namespace std;

int d[8][2] = {{-1,-1}, {0,-1}, {1,-1}, {1,0}, {1,1}, {0,1}, {-1,1}, {-1,0}};
int pic[1002][1002], mp[1002][1002];

int main(){
    int m, n, tol;
    vector<pair<int, int> > v;
    map<int, int> colors;
    cin >> m >> n >> tol;
    for(int y = 1; y <= n; y++){
        for(int x = 1; x <= m; x++){
            scanf("%d", &pic[y][x]);
            colors[pic[y][x]] ++;
        }
    }
    for(int y = 1; y <= n; y++){
        for(int x = 1; x <= m; x++){
            if(colors[pic[y][x]] == 1 && mp[y][x] == 0){
                for(int i = 0; i < 8 && mp[y][x] == 0; i++){
                    int y1 = y + d[i][0];
                    int x1 = x + d[i][1];
                    if(x1 >= 1 && x1 <= m && y1 >= 1 && y1 <= n && abs(pic[y][x] - pic[y1][x1]) <= tol){
                        mp[y][x] = 1;
                        mp[y1][x1] = 1;
                    }
                }
                if(mp[y][x] == 0){
                    v.push_back({y,x});
                }
            }
        }
    }
    if(v.size() == 0){
        printf("Not Exist");
    }else if(v.size() == 1){
        printf("(%d, %d): %d", v[0].second, v[0].first, pic[v[0].first][v[0].second]);
    }else{
        printf("Not Unique");
    }
    return 0;
}